In [9]:
import os
import sqlite3
import pandas as pd
import zipfile


assert os.path.exists("images.db")
c = sqlite3.connect("images.db")

pd.read_sql("SELECT * FROM sqlite_master", c)

,type,name,tbl_name,rootpage,sql
0,table,places,places,4,"CREATE TABLE ""places"" (\n""place_id"" INTEGER,\n..."
1,table,images,images,2,"CREATE TABLE ""images"" (\n""year"" INTEGER,\n ""i..."

In [10]:
zz = zipfile.ZipFile("images.zip")

In [11]:
pd.read_sql("SELECT * FROM images", c)

     year        image  place_id
0    2001    area0.npy       200
1    2001    area1.npy       201
2    2001    area2.npy       202
3    2001    area3.npy       203
4    2001    area4.npy       204
..    ...          ...       ...
165  2016  area165.npy       205
166  2016  area166.npy       206
167  2016  area167.npy       207
168  2016  area168.npy       208
169  2016  area169.npy       209

[170 rows x 3 columns]

In [12]:
pd.read_sql("SELECT * FROM places", c)

     place_id        name        lat        lon
0         100       samp0  42.821935 -88.151540
1         101       samp1  45.170729 -88.397469
2         102       samp2  44.941672 -89.897391
3         103       samp3  43.101989 -88.899274
4         104       samp4  46.618371 -92.127578
..        ...         ...        ...        ...
105       205    appleton  44.280000 -88.390000
106       206    waukesha  43.010000 -88.250000
107       207     oshkosh  44.020000 -88.560000
108       208   eauclaire  44.820000 -91.490000
109       209  janesville  42.690000 -89.010000

[110 rows x 4 columns]

In [13]:
df = pd.read_sql("""
  SELECT * FROM 
  images INNER JOIN places 
  ON images.place_id = places.place_id""",
  c)

In [14]:
df

     year        image  place_id  place_id        name    lat    lon
0    2001    area0.npy       200       200     madison  43.08 -89.39
1    2001    area1.npy       201       201   milwaukee  43.06 -87.97
2    2001    area2.npy       202       202    greenbay  44.52 -87.99
3    2001    area3.npy       203       203     kenosha  42.59 -87.87
4    2001    area4.npy       204       204      racine  42.73 -87.81
..    ...          ...       ...       ...         ...    ...    ...
165  2016  area165.npy       205       205    appleton  44.28 -88.39
166  2016  area166.npy       206       206    waukesha  43.01 -88.25
167  2016  area167.npy       207       207     oshkosh  44.02 -88.56
168  2016  area168.npy       208       208   eauclaire  44.82 -91.49
169  2016  area169.npy       209       209  janesville  42.69 -89.01

[170 rows x 7 columns]

In [23]:
df.loc[df["image"] == "area2.npy"]["year"].values[0]

2001

In [6]:
df = df.loc[df["name"] == "madison"]
df

     year        image  place_id  place_id     name    lat    lon
0    2001    area0.npy       200       200  madison  43.08 -89.39
10   2004   area10.npy       200       200  madison  43.08 -89.39
20   2006   area20.npy       200       200  madison  43.08 -89.39
30   2008   area30.npy       200       200  madison  43.08 -89.39
40   2011   area40.npy       200       200  madison  43.08 -89.39
50   2013   area50.npy       200       200  madison  43.08 -89.39
160  2016  area160.npy       200       200  madison  43.08 -89.39

In [7]:
df["year"]

0      2001
10     2004
20     2006
30     2008
40     2011
50     2013
160    2016
Name: year, dtype: int64

In [8]:
p = [1,2,3,4,5,6,7]
nn = pd.DataFrame()
nn["fdsa"] = p
nn.set_index('month')

KeyError: "None of ['month'] are in the columns"

In [ ]:
a = {}
a["a"] = 1
a["b"] = 3
a["c"] = 2
max(a)

In [ ]:
samp = df.loc[df["name"].str.startswith("samp")]
samp[["lat"]].values.min(),samp[["lat"]].values.max()

In [ ]:
samp.head()

In [ ]:
df.head(50)

In [ ]:
df.loc[df["name"] == "madison"]

In [ ]:
from sklearn.linear_model import LinearRegression
lr = LinearRegression()

In [ ]:
a = [1,2,3]
np.array(a).reshape(-1,1)

In [ ]:
# Viewing a Map
from zipfile import ZipFile
import io
import numpy as np
from matplotlib import pyplot as plt
from matplotlib.colors import ListedColormap

with ZipFile("images.zip") as zf:
    with zf.open("area0.npy") as f:
        buf = io.BytesIO(f.read())
        madison = np.load(buf)
madison.shape

In [ ]:
madison[:10,:10]

In [ ]:
np.isin(madison, 41).mean()

In [ ]:
madison.shape

In [ ]:
plt.figure(figsize=(8,8))
plt.imshow(madison)

In [ ]:
use_cmap = np.zeros(shape=(256,4))
use_cmap[:,-1] = 1
uses = np.array([
    [0, 0.00000000000, 0.00000000000, 0.00000000000],
    [11, 0.27843137255, 0.41960784314, 0.62745098039],
    [12, 0.81960784314, 0.86666666667, 0.97647058824],
    [21, 0.86666666667, 0.78823529412, 0.78823529412],
    [22, 0.84705882353, 0.57647058824, 0.50980392157],
    [23, 0.92941176471, 0.00000000000, 0.00000000000],
    [24, 0.66666666667, 0.00000000000, 0.00000000000],
    [31, 0.69803921569, 0.67843137255, 0.63921568628],
    [41, 0.40784313726, 0.66666666667, 0.38823529412],
    [42, 0.10980392157, 0.38823529412, 0.18823529412],
    [43, 0.70980392157, 0.78823529412, 0.55686274510],
    [51, 0.64705882353, 0.54901960784, 0.18823529412],
    [52, 0.80000000000, 0.72941176471, 0.48627450980],
    [71, 0.88627450980, 0.88627450980, 0.75686274510],
    [72, 0.78823529412, 0.78823529412, 0.46666666667],
    [73, 0.60000000000, 0.75686274510, 0.27843137255],
    [74, 0.46666666667, 0.67843137255, 0.57647058824],
    [81, 0.85882352941, 0.84705882353, 0.23921568628],
    [82, 0.66666666667, 0.43921568628, 0.15686274510],
    [90, 0.72941176471, 0.84705882353, 0.91764705882],
    [95, 0.43921568628, 0.63921568628, 0.72941176471],
])
for row in uses:
    use_cmap[int(row[0]),:-1] = row[1:]
use_cmap = ListedColormap(use_cmap)

In [ ]:
plt.figure(figsize=(8,8)) # not needed if an ax is already defined
plt.imshow(madison, cmap=use_cmap, vmin=0, vmax=255)

In [ ]:
ddd = {'madison': 39.41575011973184,
 'milwaukee': 58.12941870210729,
 'greenbay': 29.485542145593904,
 'kenosha': 29.637493773946375,
 'racine': 24.95634033764371,
 'appleton': 34.91475119731799,
 'waukesha': 52.31102741858239,
 'oshkosh': 14.563473419540237,
 'eauclaire': 18.7823721863027,
 'janesville': 16.033859255268197}

In [ ]:
max(ddd, key=ddd.get)

In [ ]:
data = pd.DataFrame()

In [ ]:
a = [1,2,3]

In [ ]:
data["a"] = a
data